In [2]:
import pandas as pd

In [4]:
data = [[1, 'Joe', 70000, 3], [2, 'Henry', 80000, 4], [3, 'Sam', 60000, None], [4, 'Max', 90000, None]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'managerId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'managerId':'Int64'})

In [5]:
employee

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4
2   3    Sam   60000       <NA>
3   4    Max   90000       <NA>

In [6]:
df_with_manager = employee.dropna()

In [7]:
df_with_manager

   id   name  salary  managerId
0   1    Joe   70000          3
1   2  Henry   80000          4

In [22]:
df = df_with_manager.merge(employee[['id', 'salary']], how='left', left_on='managerId', right_on='id')
df.drop('id_y', axis=1, inplace=True)

In [23]:
df

   id_x   name  salary_x  managerId  salary_y
0     1    Joe     70000          3     60000
1     2  Henry     80000          4     90000

In [26]:
df.columns = ['id', 'Employee', 'emp_sal', 'managerId', 'managerSalary']

In [30]:
df[df['emp_sal']>df['managerSalary']][['Employee']]

  Employee
0      Joe

In [31]:
data = [[1, 'a@b.com'], [2, 'c@d.com'], [3, 'a@b.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'Int64', 'email':'object'})

In [32]:
person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [47]:
s = person['email'].value_counts()
df = pd.DataFrame({
    'email':s.index,
    'cnt':list(s)
}, index=range(len(s)))

In [52]:
df[df['cnt']>1][['email']]

     email
0  a@b.com

In [53]:
person

   id    email
0   1  a@b.com
1   2  c@d.com
2   3  a@b.com

In [59]:
person[person.groupby('email').count()>1].reset_index()

   index    id email
0      0  <NA>   NaN
1      1  <NA>   NaN
2      2  <NA>   NaN

In [60]:
# Find duplicate emails by grouping and filtering where count > 1
duplicate_emails = person.groupby('email').filter(lambda x: len(x) > 1)[['email']].drop_duplicates()

# Display result
duplicate_emails

     email
0  a@b.com

In [63]:
person.groupby('email').filter(lambda x: len(x)>1)[['email']].drop_duplicates()

     email
0  a@b.com

In [64]:
data = [[1, 'john@example.com'], [2, 'bob@example.com'], [3, 'john@example.com']]
person = pd.DataFrame(data, columns=['id', 'email']).astype({'id':'int64', 'email':'object'})

In [65]:
person

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [66]:
person.sort_values('id')

   id             email
0   1  john@example.com
1   2   bob@example.com
2   3  john@example.com

In [67]:
person.drop_duplicates('email')

   id             email
0   1  john@example.com
1   2   bob@example.com

In [68]:
data = [[1, '2015-01-01', 10], [2, '2015-01-02', 25], [3, '2015-01-03', 20], [4, '2015-01-04', 30]]
weather = pd.DataFrame(data, columns=['id', 'recordDate', 'temperature']).astype({'id':'Int64', 'recordDate':'datetime64[ns]', 'temperature':'Int64'})

In [69]:
weather

   id recordDate  temperature
0   1 2015-01-01           10
1   2 2015-01-02           25
2   3 2015-01-03           20
3   4 2015-01-04           30

In [70]:
# Self join the weather table with itself, shifting dates by 1 day
result = pd.merge(
    weather,
    weather.shift(1).rename(columns={'temperature': 'prev_temp', 'id': 'prev_id'}),
    left_index=True,
    right_index=True
)

# Filter for dates where temperature is higher than previous day
result = result[result['temperature'] > result['prev_temp']][['id']]

# Display result
result

   id
1   2
3   4